       01 DADOS.
           03 NOME                  PIC X(100).
           03 PASSWORD              PIC X(8).
           03 EMAIL                 PIC X(100).
           03 PHONE                 PIC 9(12).
           03 ID-USUARIO            PIC 99.
